#include <iostream>
using namespace std;

int main()
{
	system(" chcp 1251 > NULL");
	int m[8];                                      //масив дл¤ хранени¤ значений разр¤дов  
	int n1 = 0,                                    // количество билетов со счастливым номером
		z;                                         // остаток от делени¤ на 12345


	cout << "8ми значные чисела с неповтор¤ющимис¤ цифрами и дел¤щиес¤ на 12345 без остатка:\n";

	for (int i = 0; i >= 0 && i <= 99999999; i++)    //переберем все возможные 8ми значные числа
	{
		int n = 0;                                 // номер элемента массива
		double x;                                     // значение разр¤да
		for (int j = 10; j <= 100000000; j *= 10)    // цикл который внесет все значени¤ разр¤дов в массив
		{

			if (n == 7)
			{
				x = i / (j / 10);
				m[n] = x;
			}
			else
			{
				x = (i % j) / (j / 10);
				m[n] = x;
			}
			n++;


		}
		z = (m[7] + m[6] * 10 + m[5] * 100 + m[4] * 1000 + m[3] * 10000 + m[2] * 100000 + m[1] * 1000000 + m[0] * 10000000) % 12345;

		if (z == 0 && m[0] != m[1] && m[0] != m[2] && m[0] != m[3] && m[0] != m[4] && m[0] != m[5] && m[0] != m[6] && m[0] != m[7]
			&& m[1] != m[0] && m[1] != m[2] && m[1] != m[3] && m[1] != m[4] && m[1] != m[5] && m[1] != m[6] && m[1] != m[7]
			&& m[2] != m[0] && m[2] != m[1] && m[2] != m[3] && m[2] != m[4] && m[2] != m[5] && m[2] != m[6] && m[2] != m[7]
			&& m[3] != m[0] && m[3] != m[1] && m[3] != m[2] && m[3] != m[4] && m[3] != m[5] && m[3] != m[6] && m[3] != m[7]
			&& m[4] != m[0] && m[4] != m[1] && m[4] != m[2] && m[4] != m[3] && m[4] != m[5] && m[4] != m[6] && m[4] != m[7]
			&& m[5] != m[0] && m[5] != m[1] && m[5] != m[2] && m[5] != m[3] && m[5] != m[4] && m[5] != m[6] && m[5] != m[7]
			&& m[6] != m[0] && m[6] != m[1] && m[6] != m[2] && m[6] != m[3] && m[6] != m[4] && m[6] != m[5] && m[6] != m[7]
			&& m[7] != m[0] && m[7] != m[1] && m[7] != m[2] && m[7] != m[3] && m[7] != m[4] && m[7] != m[5] && m[7] != m[6]
			&& m[7] != 0)
		{
			cout << m[7] << m[6] << m[5] << m[4] << m[3] << m[2] << m[1] << m[0] << "\n";
			n1++;
		}
	}

	cout << "¬сего 8ми значных чисел с неповтор¤ющимис¤ цифрами и дел¤щихс¤ на 12345 без остатка: " << n1 << "\n";
}